Masmiseim36/nxpSDK/devices/MKV46F16/mcuxpresso/startup_mkv46f16.c
    // Chip Level - MKV46F16
    DMA0_IRQHandler,                      // 16 : DMA channel 0, 16 transfer complete
    DMA1_IRQHandler,                      // 17 : DMA channel 1, 17 transfer complete
    DMA2_IRQHandler,                      // 18 : DMA channel 2, 18 transfer complete
    DMA3_IRQHandler,                      // 19 : DMA channel 3, 19 transfer complete
    DMA4_IRQHandler,                      // 20 : DMA channel 4, 20 transfer complete
    DMA5_IRQHandler,                      // 21 : DMA channel 5, 21 transfer complete
    DMA6_IRQHandler,                      // 22 : DMA channel 6, 22 transfer complete
    DMA7_IRQHandler,                      // 23 : DMA channel 7, 23 transfer complete
    DMA8_IRQHandler,                      // 24 : DMA channel 8, 24 transfer complete
    DMA9_IRQHandler,                      // 25 : DMA channel 9, 25 transfer complete
    DMA10_IRQHandler,                     // 26 : DMA channel 10, 26 transfer complete
    DMA11_IRQHandler,                     // 27 : DMA channel 11, 27 transfer complete
    DMA12_IRQHandler,                     // 28 : DMA channel 12, 28 transfer complete
    DMA13_IRQHandler,                     // 29 : DMA channel 13, 29 transfer complete
    DMA14_IRQHandler,                     // 30 : DMA channel 14, 30 transfer complete
    DMA15_IRQHandler,                     // 31 : DMA channel 15, 31 transfer complete
    DMA_Error_IRQHandler,                 // 32 : DMA error interrupt channels 0-1531
    MCM_IRQHandler,                       // 33 : MCM interrupt
    FTFA_IRQHandler,                      // 34 : Command complete
    FTFA_Collision_IRQHandler,            // 35 : Read collision
    PMC_IRQHandler,                       // 36 : Low-voltage detect, low-voltage warning
    LLWU_IRQHandler,                      // 37 : Low Leakage Wakeup
    WDOG_EWM_IRQHandler,                  // 38 : Both watchdog modules share this interrupt
    Reserved39_IRQHandler,                // 39 : Reserved interrupt
    I2C0_IRQHandler,                      // 40 : I2C0
    Reserved41_IRQHandler,                // 41 : Reserved interrupt
    SPI0_IRQHandler,                      // 42 : SPI0
    Reserved43_IRQHandler,                // 43 : Reserved interrupt
    Reserved44_IRQHandler,                // 44 : Reserved interrupt
    Reserved45_IRQHandler,                // 45 : Reserved interrupt
    Reserved46_IRQHandler,                // 46 : Reserved interrupt
    UART0_RX_TX_IRQHandler,               // 47 : UART0 status sources
    UART0_ERR_IRQHandler,                 // 48 : UART0 error sources
    UART1_RX_TX_IRQHandler,               // 49 : UART1 status sources
    UART1_ERR_IRQHandler,                 // 50 : UART1 error sources
    Reserved51_IRQHandler,                // 51 : Reserved interrupt
    Reserved52_IRQHandler,                // 52 : Reserved interrupt
    Reserved53_IRQHandler,                // 53 : Reserved interrupt
    ADC_ERR_IRQHandler,                   // 54 : ADC_ERR A and B ( zero cross, high/low limit)
    ADCA_IRQHandler,                      // 55 : ADCA Scan complete
    CMP0_IRQHandler,                      // 56 : CMP0
    CMP1_IRQHandler,                      // 57 : CMP1
    FTM0_IRQHandler,                      // 58 : FTM0 8 channels
    FTM1_IRQHandler,                      // 59 : FTM1 2 channels
    Reserved60_IRQHandler,                // 60 : Reserved interrupt
    Reserved61_IRQHandler,                // 61 : Reserved interrupt
    Reserved62_IRQHandler,                // 62 : Reserved interrupt
    Reserved63_IRQHandler,                // 63 : Reserved interrupt
    PIT0_IRQHandler,                      // 64 : PIT Channel 0
    PIT1_IRQHandler,                      // 65 : PIT Channel 1
    PIT2_IRQHandler,                      // 66 : PIT Channel 2
    PIT3_IRQHandler,                      // 67 : PIT Channel 3
    PDB0_IRQHandler,                      // 68 : PDB0
    Reserved69_IRQHandler,                // 69 : Reserved interrupt
    XBARA_IRQHandler,                     // 70 : XBARA
    PDB1_IRQHandler,                      // 71 : PDB1
    DAC0_IRQHandler,                      // 72 : DAC0
    MCG_IRQHandler,                       // 73 : MCG
    LPTMR0_IRQHandler,                    // 74 : LPTMR0
    PORTA_IRQHandler,                     // 75 : Pin detect (Port A)
    PORTB_IRQHandler,                     // 76 : Pin detect (Port B)
    PORTC_IRQHandler,                     // 77 : Pin detect (Port C)
    PORTD_IRQHandler,                     // 78 : Pin detect (Port D)
    PORTE_IRQHandler,                     // 79 : Pin detect (Port E)
    SWI_IRQHandler,                       // 80 : Software
    Reserved81_IRQHandler,                // 81 : Reserved interrupt
    ENC0_COMPARE_IRQHandler,              // 82 : ENC0 Compare
    ENC0_HOME_IRQHandler,                 // 83 : ENC0 Home
    ENC0_WDOG_SAB_IRQHandler,             // 84 : ENC0 Watchdog/Simultaneous A and B change
    ENC0_INDEX_IRQHandler,                // 85 : ENC0 Index/Roll over/Roll Under
    CMP2_IRQHandler,                      // 86 : CMP2
    FTM3_IRQHandler,                      // 87 : FTM3 8 channels
    Reserved88_IRQHandler,                // 88 : Reserved interrupt
    ADCB_IRQHandler,                      // 89 : ADCB Scan complete
    Reserved90_IRQHandler,                // 90 : Reserved interrupt
    CAN0_ORed_Message_buffer_IRQHandler,  // 91 : FLexCAN0 OR'ed Message buffer (0-15)
    CAN0_Bus_Off_IRQHandler,              // 92 : FLexCAN0 Bus Off
    CAN0_Error_IRQHandler,                // 93 : FLexCAN0 Error
    CAN0_Tx_Warning_IRQHandler,           // 94 : FLexCAN0 Transmit Warning
    CAN0_Rx_Warning_IRQHandler,           // 95 : FLexCAN0 Receive Warning
    CAN0_Wake_Up_IRQHandler,              // 96 : FLexCAN0 Wake Up
    PWMA_CMP0_IRQHandler,                 // 97 : eFlexPWM submodule 0 Compare
    PWMA_RELOAD0_IRQHandler,              // 98 : eFlexPWM submodule 0 Reload
    PWMA_CMP1_IRQHandler,                 // 99 : eFlexPWM submodule 1 Compare
    PWMA_RELOAD1_IRQHandler,              // 100: eFlexPWM submodule 1 Reload
    PWMA_CMP2_IRQHandler,                 // 101: eFlexPWM submodule 2 Compare
    PWMA_RELOAD2_IRQHandler,              // 102: eFlexPWM submodule 2 Reload
    PWMA_CMP3_IRQHandler,                 // 103: eFlexPWM submodule 3 Compare
    PWMA_RELOAD3_IRQHandler,              // 104: eFlexPWM submodule 3 Reload
    PWMA_CAP_IRQHandler,                  // 105: eFlexPWM all input captures
    PWMA_RERR_IRQHandler,                 // 106: eFlexPWM reload error
    PWMA_FAULT_IRQHandler,                // 107: eFlexPWM Fault
    CMP3_IRQHandler,                      // 108: CMP3
    Reserved109_IRQHandler,               // 109: Reserved interrupt
    CAN1_ORed_Message_buffer_IRQHandler,  // 110: FLexCAN1 OR'ed Message buffer (0-15)
    CAN1_Bus_Off_IRQHandler,              // 111: FLexCAN1 Bus Off
    CAN1_Error_IRQHandler,                // 112: FLexCAN1 Error
    CAN1_Tx_Warning_IRQHandler,           // 113: FLexCAN1 Transmit Warning
    CAN1_Rx_Warning_IRQHandler,           // 114: FLexCAN1 Receive Warning
    CAN1_Wake_Up_IRQHandler,              // 115: FLexCAN1 Wake Up

}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#else
    // Disable Watchdog
    //  Write 0xC520 to watchdog unlock register
    *((volatile unsigned short *)0x4005200E) = 0xC520;
    //  Followed by 0xD928 to complete the unlock
    *((volatile unsigned short *)0x4005200E) = 0xD928;
    // Now disable watchdog via STCTRLH register
    *((volatile unsigned short *)0x40052000) = 0x01D2u;
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

